rovCase_gci_fine/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// ROV body (BROV2 Heavy, metres): x 0..0.575, y 0..0.254, z 0..0.457
// L = 0.457 m (surge along z). Domain: 2L upstream (z-), 4L downstream (z+),
// >2L lateral (x) and vertical (y). Uniform cell size 0.045 m (~L/10).

convertToMeters 1;

vertices
(
    (-0.945 -0.945 -0.945)
    ( 1.530 -0.945 -0.945)
    ( 1.530  1.215 -0.945)
    (-0.945  1.215 -0.945)
    (-0.945 -0.945  2.295)
    ( 1.530 -0.945  2.295)
    ( 1.530  1.215  2.295)
    (-0.945  1.215  2.295)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (73 64 96) simpleGrading (1 1 1)
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 3 2 1)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }
    sideXMin
    {
        type symmetry;
        faces
        (
            (0 4 7 3)
        );
    }
    sideXMax
    {
        type symmetry;
        faces
        (
            (2 6 5 1)
        );
    }
    sideYMin
    {
        type symmetry;
        faces
        (
            (1 5 4 0)
        );
    }
    sideYMax
    {
        type symmetry;
        faces
        (
            (3 7 6 2)
        );
    }
);

// ************************************************************************* //
